tutorials/neoIcoFoam/stretchedVortex/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  diagonal;
        tolerance       1e-06;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        tolerance       1e-07;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  diagonal;
        tolerance       1e-06;
        relTol          0;
    }
}

PISO
{
    momentumPredictor   yes;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    // p is fixedValue on top/bottom, so these are unused; kept for parity
    // with the other neoIcoFoam tutorials.
    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
